src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeV2Body_tokenFromActivateV2_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<nod:sendPaymentOutcomeV2Request>
			<idPSP>#psp#</idPSP>
			<idBrokerPSP>#id_broker_psp#</idBrokerPSP>
			<idChannel>#canale_versione_primitive_2#</idChannel>
			<password>#password#</password>
			<paymentTokens>
				<paymentToken>$activatePaymentNoticeV2Response.paymentToken</paymentToken>
			</paymentTokens>
			<outcome>OK</outcome>
		</nod:sendPaymentOutcomeV2Request>
	</soapenv:Body>
</soapenv:Envelope>